<?php
$this->template('/common/header.php', $vars);
?>

<h1>Как покупать товары</h1>

<h1 class="big">Как сделать заказ? Это очень просто</h1>


<table class="markup">
<tr>
	<td><div class="li1">
	<a href="/"><strong>Зарегистрируйтесь на Comiron.com</a></strong><br>
	Это вам позволит покупать во всех магазинах открытых на Comiron или окрыть магазин самому. Общаться с магазинами, делиться покупками с друзьями, зарабатывать скидки и многое много другое.
	</div></td>
	<td><div class="li3">Оплатите заказ через Карточку или Наложенным платежом все оплаты по карте проводятся через страницу сбербанка, и данные карты мы не видим.</div></td>
</tr>
<tr>
	<td><div class="li2">Выберите понравившейся вам магазин и сделайте заказ просто положив товар в корзину</div></td>
	<td><div class="li4">Получите ваш заказ в любом отделении Почта России или в отделениях Экспресс служб или любым другим удобным для вас способом.</div></td>
</tr>
</table>

<?php
$this->template('/common/footer.php'); 
?> 